SeanSouth/O1_demo/doc/DA14680AA.xml
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>OSC16_SH_DISABLE</name>
	<description>bias in tracking mode</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>OSC16_HOLD_AMP_REG</name>
	<description>freezes amplitude regulation</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>BANDGAP_REG</name>
	<description>bandgap trimming</description>
	<addressOffset>0x00000028</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields>
	<field>
	<name>BYPASS_COLD_BOOT_DISABLE</name>
	<description>0x1 -&gt; Switch to LDO_SUPPLY_USB on vbus_available &amp; vbus_high &amp; wokenup (SET to 0x1 after boot)
0x0 -&gt; Switch to LDO_SUPPLY_USB on vbus_available</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LDO_SLEEP_TRIM</name>
	<description>0x4 --&gt; 1120 mV
0x5 --&gt; 1089 mV
0x6 --&gt; 1058 mV
0x7 --&gt; 1030 mV
0x0 --&gt; 1037 mV
0x1 --&gt; 1005 mV
0x2 --&gt; 978 mV
0x3 --&gt; 946 mV
0x8 --&gt; 952 mV
0x9 --&gt; 918 mV
0xA --&gt; 889 mV
0xB --&gt; 861 mV
0xC --&gt; 862 mV
0xD --&gt; 828 mV
0xE --&gt; 798 mV
0xF --&gt; 770 mV
These values are from simulation and vary over corners</description>
	<access>read-write</access>
	<bitRange>[13:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>BGR_ITRIM</name>
	<description>Current trimming for bias </description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>BGR_TRIM</name>
	<description>Trim register for bandgap </description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>BOD_CTRL2_REG</name>
	<description>Brown Out Detection control register</description>
	<addressOffset>0x00000036</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields>
	<field>
	<name>BOD_VBAT_EN</name>
	<description>VBAT BOD Enable</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>BOD_1V8_FLASH_EN</name>
	<description>1V8 Flash BOD Enable</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>BOD_1V8_PA_EN</name>
	<description>1V8 PA BOD Enable</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>BOD_V33_EN</name>
	<description>V33 BOD Enable</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>BOD_VDD_EN</name>
	<description>VDD BOD Enable</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>BOD_RESET_EN</name>
	<description>Generate a chip reset on BOD event</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>BOD_CTRL_REG</name>
	<description>Brown Out Detection control register</description>
	<addressOffset>0x00000034</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000755</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>BOD_VDD_LVL</name>
	<description>VDD BOD Level; 0=700mV; 1=700mV; 3=800mV; 7=1.05V</description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>BOD_V33_TRIM</name>
	<description>V33 BOD Trimming bits</description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>BOD_1V8_PA_TRIM</name>
	<description>1V8 PA BOD Trimming bits</description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>BOD_1V8_FLASH_TRIM</name>
	<description>1V8 Flash BOD Trimming bits</description>
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>BOD_VDD_TRIM</name>
	<description>VDD BOD Trimming bits</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>BOD_STATUS_REG</name>
	<description>Brown Out Detection status register</description>
	<addressOffset>0x00000038</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>BOD_VBAT_LOW</name>
	<description>Indicates VBAT &gt; VBAT_Trigger</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>BOD_V33_LOW</name>
	<description>Indicates V33 &gt; V33_Trigger</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>BOD_1V8_FLASH_LOW</name>
	<description>Indicates V18_Flash &gt; V18_Flash_Trigger</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>BOD_1V8_PA_LOW</name>
	<description>Indicates V18_PA &gt; V18_PA_Trigger</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>BOD_VDD_LOW</name>
	<description>Indicates VDD &gt; VDD_Trigger</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>CLK_16M_REG</name>
	<description>16 MHz RC and xtal oscillator register</description>
	<addressOffset>0x00000022</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000c00</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RC16M_STARTUP_DISABLE</name>
	<description>Gates the RC16M enable from the startup block.
The enable from the clksel and CLK_16M_REG[0] are not gated by this bit.</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>XTAL16_HPASS_FLT_EN</name>
	<description>enables high pass filter
</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>XTAL16_SPIKE_FLT_BYPASS</name>
	<description>bypasses spikefilter</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>XTAL16_AMP_TRIM</name>
	<description>sets xtal amplitude, 0 is minimum, 101 is maximum</description>
	<access>read-write</access>
	<bitRange>[12:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>XTAL16_EXT_CLK_ENABLE</name>
	<description>Uses the signal on the xtal-p pin as the clock, the xtal-n pin can float. </description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>XTAL16_MAX_CURRENT</name>
	<description>Uses the maximum current, for testing purpose only.</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>XTAL16_CUR_SET</name>
	<description>start-up current for the 16MHz XTAL oscillator. 000 is minimum, 110 is maximum. </description>
	<access>read-write</access>
	<bitRange>[7:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RC16M_TRIM</name>
	<description>0000 = lowest frequency
1111 = highest frequency </description>
	<access>read-write</access>
	<bitRange>[4:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RC16M_ENABLE</name>
	<description>Enables the 16MHz RC oscillator </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>CLK_32K_REG</name>
	<description>32 kHz oscillator register</description>
	<addressOffset>0x00000020</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000079c</resetValue>
	<resetMask>0x00001fff</resetMask>
	<fields>
	<field>
	<name>XTAL32K_DISABLE_AMPREG</name>
	<description>Setting this bit disables the amplitude regulation of the XTAL32kHz oscillator.
Set this bit to '1' for an external clock to XTAL32Kp
Keep this bit '0' with a crystal between XTAL32Kp and XTAL32Km</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RC32K_TRIM</name>
	<description>0000 = lowest frequency
0111 = default
1111 = highest frequency </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RC32K_ENABLE</name>
	<description>Enables the 32kHz RC oscillator </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>XTAL32K_CUR</name>
	<description>Bias current for the 32kHz XTAL oscillator. 0000 is minimum, 1111 is maximum, 0011 is default. For each application there is an optimal setting for which the start-up behavior is optimal </description>
	<access>read-write</access>
	<bitRange>[6:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>XTAL32K_RBIAS</name>
	<description>Setting for the bias resistor. 00 is maximum, 11 is minimum. Prefered setting will be provided by Dialog </description>
	<access>read-write</access>
	<bitRange>[2:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>XTAL32K_ENABLE</name>
	<description>Enables the 32kHz XTAL oscillator </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>CLK_AMBA_REG</name>
	<description>HCLK, PCLK, divider and clock gates</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000022</resetValue>
	<resetMask>0x00001fff</resetMask>
	<fields>
	<field>
	<name>QSPI_ENABLE</name>
	<description>Clock enable for QSPI controller </description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>QSPI_DIV</name>
	<description>QSPI divider
00 = divide by 1
01 = divide by 2
10 = divide by 4
11 = divide by 8</description>
	<access>read-write</access>
	<bitRange>[11:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>OTP_ENABLE</name>
	<description>Clock enable for OTP controller </description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TRNG_CLK_ENABLE</name>
	<description>Clock enable for TRNG block </description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ECC_CLK_ENABLE</name>
	<description>Clock enable for ECC block </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>AES_CLK_ENABLE</name>
	<description>Clock enable for AES crypto block </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PCLK_DIV</name>
	<description>APB interface clock, Cascaded with HCLK:
00 = divide hclk by 1
01 = divide hclk by 2
10 = divide hclk by 4
11 = divide hclk by 8 </description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>HCLK_DIV</name>
	<description>AHB interface and microprocessor clock. Source clock divided by:
000 = divide hclk by 1
001 = divide hclk by 2
010 = divide hclk by 4
011 = divide hclk by 8
1xx = divide hclk by 16</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>CLK_CTRL_REG</name>
	<description>Clock control register</description>
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00002001</resetValue>
	<resetMask>0x0000f3ff</resetMask>
	<fields>
	<field>
	<name>RUNNING_AT_PLL96M</name>
	<description>Indicates that the PLL96MHz clock is used as clock, and may not be switched off </description>
	<access>read-only</access>
	<bitRange>[15:15]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RUNNING_AT_XTAL16M</name>
	<description>Indicates that the XTAL16M clock is used as clock, and may not be switched off </description>
	<access>read-only</access>
	<bitRange>[14:14]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RUNNING_AT_RC16M</name>
	<description>Indicates that the RC16M clock is used as clock </description>
	<access>read-only</access>
	<bitRange>[13:13]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RUNNING_AT_32K</name>
	<description>Indicates that either the RC32k or XTAL32k is being used as clock </description>
	<access>read-only</access>
	<bitRange>[12:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CLK32K_SOURCE</name>
	<description>Sets the clock source of the LowerPower clock
'00': 32 Khz RC Oscillator
'01': RCX Oscillator
'10': XTAL32kHz, when using an external crystal i.c.w. the internal oscillator (set P20 and P21 to FUNC_XTAL32)
'11': XTAL32kHz, when an external generator or MCU applies a square wave on P20 (set P20 to FUNC_GPIO)</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DIVN_SYNC_LEVEL</name>
	<description>Level of the RF divider to sync with in case XTAL32_MODE is set.
This is used to align the internal DIVN clock XTAL@32MHz divided by 2 with the radio clock</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DIVN_XTAL32M_MODE</name>
	<description>Enables the DIVN divide-by-2, in case of a 32 MHz crystal (See also XTAL32M_MODE), to keep the DIVN clock at 16 MHz.</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PLL_DIV2</name>
	<description>Divides the PLL clock by 2 before being used</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_CLK_SRC</name>
	<description>Selects the USB source clock
0 : PLL clock, divided by 2
1 : HCLK</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>XTAL32M_MODE</name>
	<description>Enables dividers in the XTAL for both the RF and the BB PLL.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>XTAL16M_DISABLE</name>
	<description>Setting this bit instantaneously disables the 16 MHz crystal oscillator. This bit may not be set to '1' when "RUNNING_AT_XTAL16M is '1' to prevent deadlock. After resetting this bit, wait for XTAL16_TRIM_READY to become '1' before switching to XTAL16 clock source. </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SYS_CLK_SEL</name>
	<description>Selects the clock source.
0x0 : XTAL16M (check the XTAL16_TRIM_READY bit!!)
0x1 : RC16M
0x2 : The Low Power clock is used
0x3 : The PLL96Mhz is used</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>CLK_FREQ_TRIM_REG</name>
	<description>Xtal frequency trimming register.</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>COARSE_ADJ</name>
	<description>Xtal frequency course trimming register.
0x0 = lowest frequency
0x7 = highest frequencyIncrement or decrement the binary value with 1. Wait approximately 200usec to allow the adjustment to settle. </description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>FINE_ADJ</name>
	<description>Xtal frequency fine trimming register.0x00 = lowest frequency
0xFF = highest frequency </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>CLK_RADIO_REG</name>
	<description>Radio PLL control register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000040</resetValue>
	<resetMask>0x00000bfb</resetMask>
	<fields>
	<field>
	<name>FTDF_MAC_ENABLE</name>
	<description>Enable the FTDF MAC core clocks </description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>FTDF_MAC_DIV</name>
	<description>Division factor for FTCF MAC clock, relative to the DIVN clock
00 = Divide by 1
01 = Divide by 2
10 = Divide by 4
11 = Divide by 8
It should always be set to 00.</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>BLE_ENABLE</name>
	<description>Enable the BLE core clocks.
When the BLE system clock is disabled, either due to the CLK_RADIO_REG[BLE_ENABLE] or due to the PMU_CTRL_REG[BLE_SLEEP], then any access to the BLE Register file will issue a hard fault to the CPU.</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>BLE_LP_RESET</name>
	<description>Reset for the BLE LP timer </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>BLE_DIV</name>
	<description>Division factor for BLE core blocks, having as reference the DIVN clock:
00 = Divide by 1
01 = Divide by 2
10 = Divide by 4
11 = Divide by 8
The programmed frequency should not be lower than 8MHz, not faster than 16MHz and not faster than the programmed CPU clock frequency. Refer also to BLE_CNTL2_REG[BLE_CLK_SEL].</description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RFCU_ENABLE</name>
	<description>Enable the RF control Unit clock </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RFCU_DIV</name>
	<description>Division factor for RF Control Unit
0x0 = divide by 1
0x1 = divide by 2
0x2 = divide by 4
0x3 = divide by 8
The programmed frequency must be exactly 8MHz. </description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>CLK_RCX20K_REG</name>
	<description>20KHz RXC-oscillator control register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000178</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>RCX20K_ENABLE</name>
	<description>Enable the RCX32 oscillator</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RCX20K_LOWF</name>
	<description>Extra low frequency</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RCX20K_BIAS</name>
	<description>Bias control</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RCX20K_NTC</name>
	<description>Temperature control</description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RCX20K_TRIM</name>
	<description>0000 = lowest frequency
0111 = default
1111 = highest frequency </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>CLK_TMR_REG</name>
	<description>Clock control for the timers</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields>
	<field>
	<name>P06_TMR1_PWM_MODE</name>
	<description>Maps Timer1_pwm onto P0_6, when DEBUGGER_EN = '0'.
This state is preserved during deep sleep, to allow PWM5 output on the pad during deep sleep.</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>WAKEUPCT_ENABLE</name>
	<description>Enables the clock</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>BREATH_ENABLE</name>
	<description>Enables the clock</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TMR2_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TMR2_ENABLE</name>
	<description>Enable timer clock</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TMR2_DIV</name>
	<description>Division factor for Timer
0x0 = divide by 1
0x1 = divide by 2
0x2 = divide by 4
0x3 = divide by 8 </description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TMR1_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<access>read-write</access>
