SeanSouth/O1_demo/doc/DA14680AA.xml
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TMR1_ENABLE</name>
	<description>Enable timer clock</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TMR1_DIV</name>
	<description>Division factor for Timer
0x0 = divide by 1
0x1 = divide by 2
0x2 = divide by 4
0x3 = divide by 8 </description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TMR0_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TMR0_ENABLE</name>
	<description>Enable timer clock</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TMR0_DIV</name>
	<description>Division factor for Timer
0x0 = divide by 1
0x1 = divide by 2
0x2 = divide by 4
0x3 = divide by 8 </description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>DIVN_SYNC_REG</name>
	<description>Trigger to sync DIVN with the RF clock divider in case of 32 MHz crystal</description>
	<addressOffset>0x00000018</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>DIVN_SYNC</name>
	<description>Writing any value to this register causes the divn clock to be synced with the RF divider.
This is only used when XTAL32M_MODE='1', and running on the XTAL16M (in 32 MHz mode)</description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FORCE_SLEEP_REG</name>
	<description>Force FTDF/BLE to sleep</description>
	<addressOffset>0x00000060</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields>
	<field>
	<name>FORCE_BLE_SLEEP</name>
	<description>Once set, the BLE can't be woken up
This bit is set only, and reset with power on reset</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>FORCE_FTDF_SLEEP</name>
	<description>Once set, the FTDF can't be woken up
This bit is set only, and reset with power on reset</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>LDOS_DISABLE_REG</name>
	<description>Force off all LDOs</description>
	<addressOffset>0x00000062</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>LDOS_DISABLE</name>
	<description>If set to '1', the following LDOS are disabled:
LDO_SUPPLY_VBAT (V33)
LDO_SUPPLY_VBUS (V33)
LDO_VBAT_RET (V33)
LDO_1V8_PA
LDO_1V8_PA_RET
LDO_1V8_FLASH
LDO_1V8_FLASH_RET
LDO_CORE (VDD1V2)
</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>LDO_CTRL1_REG</name>
	<description>LDO control register</description>
	<addressOffset>0x0000003a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000000ab</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields>
	<field>
	<name>LDO_RADIO_ENABLE</name>
	<description>Enables (1) or disables (0) LDO_RADIO</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LDO_RADIO_SETVDD</name>
	<description>Sets the output voltage of LDO_RADIO
000 = 1.30 V
001 = 1.35 V
010 = 1.40 V
011 = 1.45 V
1XX = 1.50 V</description>
	<access>read-write</access>
	<bitRange>[13:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LDO_CORE_SETVDD</name>
	<description>Sets the output voltage of LDO_CORE
000 = 1.20 V
001 = 1.15 V
010 = 1.10 V
011 = 1.05 V
1XX = 1.32 V</description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LDO_SUPPLY_USB_LEVEL</name>
	<description>Sets the output voltage of LDO_SUPPLY_USB
00 = 2.40 V
01 = 3.30 V
10 = 3.45 V
11 = 3.60 V</description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LDO_SUPPLY_VBAT_LEVEL</name>
	<description>Sets the output voltage of LDO_SUPPLY_VBAT
00 = 2.40 V
01 = 3.30 V
10 = 3.45 V
11 = 3.60 V</description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LDO_VBAT_RET_LEVEL</name>
	<description>Sets the output voltage of LDO_VBAT_RET
00 = 2.40 V
01 = 3.30 V
10 = 3.45 V
11 = 3.60 V</description>
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LDO_CORE_CURLIM</name>
	<description>Sets the current limit of LDO_CORE
00 = Current limiter disabled
01 = 8 mA
10 = 60 mA
11 = 80 mA</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>LDO_CTRL2_REG</name>
	<description>LDO control register</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>LDO_1V8_PA_RET_DISABLE</name>
	<description>Disables (1) or enables (0) LDO_1V8_PA_RET</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LDO_1V8_FLASH_RET_DISABLE</name>
	<description>Disables (1) or enables (0) LDO_1V8_FLASH_RET</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LDO_VBAT_RET_DISABLE</name>
	<description>Disables (1) or enables (0) LDO_VBAT_RET</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LDO_1V8_PA_ON</name>
	<description>Enables (1) or disables (0) LDO_1V8_PA</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LDO_1V8_FLASH_ON</name>
	<description>Enables (1) or disables (0) LDO_1V8_FLASH</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LDO_3V3_ON</name>
	<description>Enables (1) or disables (0) LDO_SUPPLY_VBAT and LDO_SUPPLY_USB</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>LDO_1V2_ON</name>
	<description>Enables (1) or disables (0) LDO_CORE</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>PMU_CTRL_REG</name>
	<description>Power Management Unit control register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x0000ffef</resetMask>
	<fields>
	<field>
	<name>RETAIN_ECCRAM</name>
	<description>Selects the retainability of the ECC RAM during deep sleep.
'1' is retainable, '0' is power gated</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RETAIN_CACHE</name>
	<description>Selects the retainability of the cache block during deep sleep.
'1' is retainable, '0' is power gated</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ENABLE_CLKLESS</name>
	<description>Selects the clockless sleep mode. Wakeup is done asynchronously.
When set to '1', the lp_clk is stopped during deep sleep, until a wakeup event (not debounced) is detected by the WAKUPCT block.
When set to '0', the lp_clk continues running, so the MAC counters keep on running.
This mode cannot be combined with regulated sleep, so keep SLEEP_TIMER=0 when using ENABLE_CLKLESS.</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RETAIN_RAM</name>
	<description>Select the retainability of the 5 system memory RAM macros during deep sleep.
'1' is retainable, '0' is power gated
(4) is SYSRAM5
(3) is SYSRAM4
(2) is SYSRAM3
(1) is SYSRAM2
(0) is SYSRAM1</description>
	<access>read-write</access>
	<bitRange>[12:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>OTP_COPY_DIV</name>
	<description>Sets the HCLK division during OTP mirroring </description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RESET_ON_WAKEUP</name>
	<description>Perform a Hardware Reset after waking up. Booter will be started. </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>FTDF_SLEEP</name>
	<description>Put the FTDF in powerdown </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>BLE_SLEEP</name>
	<description>Put the BLE in powerdown.
When the BLE system clock is disabled, either due to the CLK_RADIO_REG[BLE_ENABLE] or due to the PMU_CTRL_REG[BLE_SLEEP], then any access to the BLE Register file will issue a hard fault to the CPU.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RADIO_SLEEP</name>
	<description>Put the digital part of the radio in powerdown </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PERIPH_SLEEP</name>
	<description>Put all peripherals (I2C, UART, SPI, ADC) in powerdown </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>POWER_CTRL_REG</name>
	<description>Power control register</description>
	<addressOffset>0x00000040</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000002</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields>
	<field>
	<name>TRIM_NEWBAT</name>
	
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>SLEEP_TIMER_REG</name>
	<description>Timer for regulated sleep</description>
	<addressOffset>0x0000003e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SLEEP_TIMER</name>
	<description>Defines the amount of ticks of the sleep clock between enabling the bandgap for re-charging the retention LDOs. This value depends on the load and should be calibrated on a per application basis.If set to 0, no recharging cycle will happen at all.
Keep this value to 0 (no recharging) when using the clockless sleep.</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>STARTUP_STATUS_REG</name>
	<description>Startup timeout bits</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields>
	<field>
	<name>SU_LDO_1V8_FLASH_OK</name>
	
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SU_NEWBAT</name>
	
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SU_COMP_1V8_FLASH_HIGH</name>
	
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SU_COMP_1V8_PA_HIGH</name>
	
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SU_COMP_VBUS_LOW</name>
	
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SU_COMP_VBUS_HIGH</name>
	
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SU_COMP_V33_HIGH</name>
	
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SU_COMP_VDD_HIGH</name>
	
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SU_LDO_1V8_PA_OK</name>
	
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SU_LDO_CORE_OK</name>
	
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SU_LOD_SUPPLY_USB_OK</name>
	
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SU_LDO_SUPPLY_VBAT_OK</name>
	
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SU_VBUS_AVAILABLE</name>
	
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SU_BANDGAP_OK</name>
	
