SeanSouth/O1_demo/doc/DA14680AA.xml
Note1 that this is a conversion from rx DPHY interface to the internal data byte
So
for(n=7;n&gt;=0;n--)
rx_data(n) = dphy_bit(tx_BitPos(n))
endfor

Note2 that rxBitPos and txBitPos must have inverse functions. </description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_PHY_PARAMETERS_1_REG</name>
	<description>Lmac PHY parameter register</description>
	<addressOffset>0x00010184</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x76543210</resetValue>
	<resetMask>0x77777777</resetMask>
	<fields>
	<field>
	<name>TXBITPOS_7</name>
	<description>See txBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[30:28]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TXBITPOS_6</name>
	<description>See txBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[26:24]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TXBITPOS_5</name>
	<description>See txBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[22:20]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TXBITPOS_4</name>
	<description>See txBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[18:16]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TXBITPOS_3</name>
	<description>See txBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[14:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TXBITPOS_2</name>
	<description>See txBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TXBITPOS_1</name>
	<description>See txBitPos_0 </description>
	<access>read-write</access>
	<bitRange>[6:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TXBITPOS_0</name>
	<description>Control txBitPos(8)(3) controls the position that a bit should have at the DPHY interface.
So the default values are txBitPos_0 = 0, txBitPos_1 = 1, txBitPos_2 = 2, etc.

Note1 that this is a conversion from internal data byte to the DPHY interface.
So
for(n=7;n&gt;=0;n--)
tx_dphy_bit(n) = tx_data(tx_BitPos(n))
endfor

Note2 that txBitPos and rxBitPos must have inverse functions. </description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_PHY_PARAMETERS_2_REG</name>
	<description>Lmac PHY parameter register</description>
	<addressOffset>0x00010188</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PHYTRXWAIT</name>
	<description>Phy wait time between TX_EN/RX_EN </description>
	<access>read-write</access>
	<bitRange>[31:24]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYTXFINISH</name>
	<description>Phy wait time before deasserting TX_EN </description>
	<access>read-write</access>
	<bitRange>[23:16]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYTXLATENCY</name>
	<description>Phy delay between DPHY i/f and air </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYTXSTARTUP</name>
	<description>Phy wait time before transmission </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_PHY_PARAMETERS_3_REG</name>
	<description>Lmac PHY parameter register</description>
	<addressOffset>0x0001018c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields>
	<field>
	<name>PHYENABLE</name>
	<description>Asserting the DPHY interface signals TX_EN or RX_EN does not take place within the time phyEnable after asserting the signal phy_en.
(resolution: ~s). </description>
	<access>read-write</access>
	<bitRange>[23:16]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYRXLATENCY</name>
	<description>Phy delay between air and DPHY i/f </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYRXSTARTUP</name>
	<description>Phy wait time before receiving </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_REL_NAME_0_REG</name>
	<description>Name of the release</description>
	<addressOffset>0x00010000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>REL_NAME</name>
	<description>Name of the release </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_REL_NAME_1_REG</name>
	<description>Name of the release</description>
	<addressOffset>0x00010004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>REL_NAME</name>
	<description>Name of the release </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_REL_NAME_2_REG</name>
	<description>Name of the release</description>
	<addressOffset>0x00010008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>REL_NAME</name>
	<description>Name of the release </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_REL_NAME_3_REG</name>
	<description>Name of the release</description>
	<addressOffset>0x0001000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>REL_NAME</name>
	<description>Name of the release </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_RX_CONTROL_0_REG</name>
	<description>Receive control register</description>
	<addressOffset>0x00010200</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0fffffff</resetMask>
	<fields>
	<field>
	<name>DISRXACKRECEIVEDCA</name>
	<description>If set, the LMAC controller shall ignore all consequent actions upon a set AR bit in the transmitted frame </description>
	<access>read-write</access>
	<bitRange>[27:27]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MACIMPLICITBROADCAST</name>
	<description>If set, Frame Version 2 frames without Daddr or DPANId shall be accepted. </description>
	<access>read-write</access>
	<bitRange>[26:26]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MACPASSWAKEUP</name>
	<description>If set, WakeUp frames will not be reported but will be put into the Rx buffer. </description>
	<access>read-write</access>
	<bitRange>[25:25]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MACALWAYSPASSWAKEUP</name>
	<description>If the control register macAlwaysPassWakeUp is set, received Wake- up frames for this device are put into the Rx packet buffer without notifying the LMAC Controller. </description>
	<access>read-write</access>
	<bitRange>[24:24]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MACALWAYSPASSFRMTYPE</name>
	<description>The control registers macAlwaysPassFrmType[7:0], shall control if this Frame Type shall be dropped.
If a bit is set, the Frame Type corresponding with the bit position is not dropped, even in case of a CRC error.
Example: if bit 1 is set, Frame Type 1 shall not be dropped.
The error shall be reported in the Rx meta data </description>
	<access>read-write</access>
	<bitRange>[23:16]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MACALWAYSPASSTOPANCOORDINATOR</name>
	<description>When the control register macAlwaysPassToPanCoordinator is set, the frame is not dropped due to a span_coord_error.
However, in case of an FCS error, the packet is dropped. </description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MACALWAYSPASSBEACONWRONGPANID</name>
	<description>If the control register macAlwaysPassBeaconWrongPANId is set, the frame is not dropped in case of a mismatch in PAN-ID, irrespective of the setting of RxBeaconOnly. </description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MACALWAYSPASSWRONGDADDR</name>
	<description>If set, a packet with a wrong DAddr is not dropped </description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MACALWAYSPASSWRONGDPANID</name>
	<description>If register macAlwaysPassWrongDPANId is set, packet with a wrong Destiantion PanID will not be dropped.
However, in case of an FCS error, the packet is dropped. </description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MACALWAYSPASSRESFRAMEVERSION</name>
	<description>If set, a packet with a reserved FrameVersion shall not be dropped </description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DISDATAREQUESTCA</name>
	<description>When the control register DisDataRequestCa is set, the notification of the received Data Request is disabled. </description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MACALWAYSPASSCRCERROR</name>
	<description>If set, a FCS error will not drop the frame </description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DISRXACKREQUESTCA</name>
	<description>When the control register DisRxAckRequestca is set all consequent actions for a received Acknowledge Request bit are disabled. </description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DISRXFRMPENDINGCA</name>
	<description>Whan the control register DisRxFrmPendingCa is set, the notification of the received FP bit to the LMAC Controller is disabled. </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RX_READ_BUF_PTR</name>
	<description>Indication where new data will be read
All four bits shall be used when using these pointer values (0d - 15d).
However, the Receive Packet buffer has a size of 8 entries.
So reading the Receive Packet buffer entries shall use the mod8 of the pointer values. </description>
	<access>read-write</access>
	<bitRange>[6:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RXCOORDREALIGNONLY</name>
	<description>If set, only Coordinator Realignment frames are accepted </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RXBEACONONLY</name>
	<description>If set, only Beacons frames are accepted </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DBGRXTRANSPARENTMODE</name>
	<description>If set, Rx pipe is fully set in transparent mode (for debug purpose). </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_RX_EVENT_REG</name>
	<description>Receive event register</description>
	<addressOffset>0x00010204</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields>
	<field>
	<name>RXBYTE_E</name>
	<description>Indicates the first byte of a new packet is received </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RX_BUF_AVAIL_E</name>
	<description>Indicates that a new packet is received </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RX_OVERFLOW_E</name>
	<description>Indicates that the Rx packet buffer has an
overflowl </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RXSOF_E</name>
	<description>Set when RX_SOF has been detected. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_RX_FIFO_0_0_REG</name>
	<description>Address receive fifo 0</description>
	<addressOffset>0x00008000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_FIFO</name>
	<description>Receive fifo ram, contains 32 addresses per entry (32b x 32a = 128B). There are 8 entries supported. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_RX_FIFO_1_0_REG</name>
	<description>Address transmit fifo 1</description>
	<addressOffset>0x00008080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_FIFO</name>
	<description>Receive fifo ram, contains 32 addresses per entry (32b x 32a = 128B). There are 8 entries supported. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_RX_FIFO_2_0_REG</name>
	<description>Address transmit fifo 2</description>
	<addressOffset>0x00008100</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_FIFO</name>
	<description>Receive fifo ram, contains 32 addresses per entry (32b x 32a = 128B). There are 8 entries supported. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_RX_FIFO_3_0_REG</name>
	<description>Address transmit fifo 3</description>
	<addressOffset>0x00008180</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_FIFO</name>
	<description>Receive fifo ram, contains 32 addresses per entry (32b x 32a = 128B). There are 8 entries supported. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_RX_FIFO_4_0_REG</name>
	<description>Address transmit fifo 4</description>
	<addressOffset>0x00008200</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_FIFO</name>
	<description>Receive fifo ram, contains 32 addresses per entry (32b x 32a = 128B). There are 8 entries supported. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_RX_FIFO_5_0_REG</name>
	<description>Address transmit fifo 5</description>
	<addressOffset>0x00008280</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_FIFO</name>
	<description>Receive fifo ram, contains 32 addresses per entry (32b x 32a = 128B). There are 8 entries supported. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_RX_FIFO_6_0_REG</name>
	<description>Address transmit fifo 6</description>
	<addressOffset>0x00008300</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_FIFO</name>
	<description>Receive fifo ram, contains 32 addresses per entry (32b x 32a = 128B). There are 8 entries supported. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_RX_FIFO_7_0_REG</name>
	<description>Address transmit fifo 7</description>
	<addressOffset>0x00008380</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_FIFO</name>
	<description>Receive fifo ram, contains 32 addresses per entry (32b x 32a = 128B). There are 8 entries supported. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_RX_MASK_REG</name>
	<description>Receive event mask register</description>
	<addressOffset>0x00010208</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields>
	<field>
	<name>RXBYTE_M</name>
	<description>Mask bit for event &amp;quot;rxbyte_e&amp;quot;. </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RX_BUF_AVAIL_M</name>
	<description>Mask bit for event &amp;quot;rx_buf_avail_e&amp;quot;. </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RX_OVERFLOW_M</name>
	<description>Mask bit for event &amp;quot; rx_overflow_e&amp;quot;. </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RXSOF_M</name>
	<description>Mask bit for event &amp;quot;RxSof_e&amp;quot;. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_RX_META_0_0_REG</name>
	<description>Receive metadata register 0</description>
	<addressOffset>0x00000280</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_TIMESTAMP</name>
	<description>Timestamp taken when frame was received </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_RX_META_0_1_REG</name>
	<description>Receive metadata register 1</description>
	<addressOffset>0x00000290</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_TIMESTAMP</name>
	<description>Timestamp taken when frame was received </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_RX_META_0_2_REG</name>
	<description>Receive metadata register 2</description>
	<addressOffset>0x000002a0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_TIMESTAMP</name>
	<description>Timestamp taken when frame was received </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_RX_META_0_3_REG</name>
	<description>Receive metadata register 3</description>
	<addressOffset>0x000002b0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_TIMESTAMP</name>
	<description>Timestamp taken when frame was received </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_RX_META_0_4_REG</name>
	<description>Receive metadata register 4</description>
	<addressOffset>0x000002c0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_TIMESTAMP</name>
	<description>Timestamp taken when frame was received </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_RX_META_0_5_REG</name>
	<description>Receive metadata register 5</description>
	<addressOffset>0x000002d0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_TIMESTAMP</name>
	<description>Timestamp taken when frame was received </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_RX_META_0_6_REG</name>
	<description>Receive metadata register 6</description>
	<addressOffset>0x000002e0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_TIMESTAMP</name>
	<description>Timestamp taken when frame was received </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_RX_META_0_7_REG</name>
	<description>Receive metadata register 7</description>
	<addressOffset>0x000002f0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RX_TIMESTAMP</name>
	<description>Timestamp taken when frame was received </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
