SeanSouth/O1_demo/doc/DA14680AA.xml
	<addressOffset>0x00000094</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000a492</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>MOD_VAR_V1</name>
	<description>Bias voltage of the VCO Modulation varactor (high Vmod)
0: low
1: mid
2: nominal
3: high </description>
	<access>read-write</access>
	<bitRange>[15:14]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MOD_VAR_V0</name>
	<description>Bias voltage of the VCO Modulation varactor (low Vmod)
0: low
1: mid
2: nominal
3: high </description>
	<access>read-write</access>
	<bitRange>[13:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TUNE_VAR_V3</name>
	<description>Bias voltage of the VCO Tuning varactor (high Vtune)
001: low
010: nominal
100: high
others: not allowed</description>
	<access>read-write</access>
	<bitRange>[11:9]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TUNE_VAR_V2</name>
	<description>Bias voltage of the VCO Tuning varactor (high-mid Vtune)
Coding identical to TUNE_VAR_V3 </description>
	<access>read-write</access>
	<bitRange>[8:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TUNE_VAR_V1</name>
	<description>Bias voltage of the VCO Tuning varactor (low-mid Vtune)
Coding identical to TUNE_VAR_V3</description>
	<access>read-write</access>
	<bitRange>[5:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TUNE_VAR_V0</name>
	<description>Bias voltage of the VCO Tuning varactor (low Vtune)
Coding identical to TUNE_VAR_V3</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>RFCU_POWER</name>
	<version>1.0</version>
	<description>RFCU_POWER registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50002200</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>396</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>RF_ALWAYS_EN1_REG</name>
	
	<addressOffset>0x00000180</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ALW_EN_PA_EN</name>
	
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_PA_RAMP_EN</name>
	
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_LNA_LDO_ZERO</name>
	
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_CP_BIAS_EN</name>
	
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_VCO_BIAS_EN</name>
	
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_CP_SWITCH_EN</name>
	
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_PA_LDO_EN</name>
	
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_PFD_LDO_EN</name>
	
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_MD_LDO_EN</name>
	
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_VCO_LDO_EN</name>
	
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_IFFADC_LDO_EN</name>
	
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_IFF_LDO_EN</name>
	
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_MIX_LDO_EN</name>
	
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_LNA_CGM_EN</name>
	
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_LNA_CORE_EN</name>
	
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_LNA_LDO_EN</name>
	
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ALWAYS_EN2_REG</name>
	
	<addressOffset>0x00000182</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ALW_EN_GAUSS_BIAS_SH</name>
	
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_IFFMIX_BIAS_SH_OPEN</name>
	
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_VCO_BIAS_SH_OPEN</name>
	
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_CP_BIAS_SH_OPEN</name>
	
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_DIV2_EN</name>
	
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_RXIQ_EN</name>
	
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_LOBUF_PA_EN</name>
	
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_RFIO_TXRX</name>
	
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_GAUSS_EN</name>
	
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_PDF_EN</name>
	
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_CP_EN</name>
	
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_LOBUF_MD_EN</name>
	
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_VCO_EN</name>
	
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_ADC_EN</name>
	
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_IFF_EN</name>
	
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_MIX_EN</name>
	
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ALWAYS_EN3_REG</name>
	
	<addressOffset>0x00000184</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ALW_EN_SPARE3_EN</name>
	
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_SPARE2_EN</name>
	
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_TXDAC_EN</name>
	
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_TR_PWRM_OFF_EN</name>
	
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_ADC_CLK_EN</name>
	
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_LDO_RADIO_EN</name>
	
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_RFIO_BIAS_SH</name>
	
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_RFIO_BIAS_EN</name>
	
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_LDO_RFIO_EN</name>
	
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_TDC_EN</name>
	
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_CAL_EN</name>
	
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_LDO_ZERO_EN</name>
	
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_DEM_EN</name>
	
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_PLLCLOSED_EN</name>
	
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_PLL_DIG_EN</name>
	
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_MIX_BIAS_SH</name>
	
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ALWAYS_EN4_REG</name>
	
	<addressOffset>0x00000186</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields>
	<field>
	<name>ALW_EN_DEM_FTDF_EN</name>
	
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ALW_EN_SPARE4_EN</name>
	
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_10_REG</name>
	
