SeanSouth/O1_demo/doc/DA14680AA.xml
	<addressOffset>0x0000002c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000063</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>pfd_en_ble_dcf_tx</name>
	<description>DCF timer for pfd_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>pfd_en_ble_dcf_rx</name>
	<description>DCF timer for pfd_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG22_FTDF_REG</name>
	
	<addressOffset>0x000000ac</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000063</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>pfd_en_ftdf_dcf_tx</name>
	<description>DCF timer for ftdf_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>pfd_en_ftdf_dcf_rx</name>
	<description>DCF timer for ftdf_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG23_BLE_REG</name>
	
	<addressOffset>0x0000002e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000060</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>gauss_en_ble_dcf_tx</name>
	<description>DCF timer for gauss_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>gauss_en_ble_dcf_rx</name>
	<description>DCF timer for gauss_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG23_FTDF_REG</name>
	
	<addressOffset>0x000000ae</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>gauss_en_ftdf_dcf_tx</name>
	<description>DCF timer for gauss_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>gauss_en_ftdf_dcf_rx</name>
	<description>DCF timer for gauss_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG24_BLE_REG</name>
	
	<addressOffset>0x00000030</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000001a0</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>rfio_txrx_ble_dcf_tx</name>
	<description>DCF timer for rfio_txrx in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>rfio_txrx_ble_dcf_rx</name>
	<description>DCF timer for rfio_txrx in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG24_FTDF_REG</name>
	
	<addressOffset>0x000000b0</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000060</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>rfio_txrx_ftdf_dcf_tx</name>
	<description>DCF timer for rfio_txrx in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>rfio_txrx_ftdf_dcf_rx</name>
	<description>DCF timer for rfio_txrx in tx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG25_BLE_REG</name>
	
	<addressOffset>0x00000032</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000060</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>lobuf_pa_en_ble_dcf_tx</name>
	<description>DCF timer for lobuf_pa_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>lobuf_pa_en_ble_dcf_rx</name>
	<description>DCF timer for lobuf_pa_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG25_FTDF_REG</name>
	
	<addressOffset>0x000000b2</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000001a0</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>lobuf_pa_en_ftdf_dcf_tx</name>
	<description>DCF timer for lobuf_pa_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>lobuf_pa_en_ftdf_dcf_rx</name>
	<description>DCF timer for lobuf_pa_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG26_BLE_REG</name>
	
	<addressOffset>0x00000034</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000004</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>lobuf_rxiq_en_ble_dcf_tx</name>
	<description>DCF timer for lobuf_rxiq_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>lobuf_rxiq_en_ble_dcf_rx</name>
	<description>DCF timer for lobuf_rxiq_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG26_FTDF_REG</name>
	
	<addressOffset>0x000000b4</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000004</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>lobuf_rxiq_en_ftdf_dcf_tx</name>
	<description>DCF timer for lobuf_rxiq_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>lobuf_rxiq_en_ftdf_dcf_rx</name>
	<description>DCF timer for lobuf_rxiq_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG27_BLE_REG</name>
	
