SeanSouth/O1_demo/doc/DA14680AA.xml
	<addressOffset>0x00000088</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>iff_ldo_en_ftdf_dcf_tx</name>
	<description>DCF timer for iff_ldo_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>iff_ldo_en_ftdf_dcf_rx</name>
	<description>DCF timer for iff_ldo_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG5_BLE_REG</name>
	
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000004</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>iffadc_ldo_en_ble_dcf_tx</name>
	<description>DCF timer for iffadc_ldo_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>iffadc_ldo_en_ble_dcf_rx</name>
	<description>DCF timer for iffadc_ldo_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG5_FTDF_REG</name>
	
	<addressOffset>0x0000008a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000004</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>iffadc_ldo_en_ftdf_dcf_tx</name>
	<description>DCF timer for iffadc_ldo_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>iffadc_ldo_en_ftdf_dcf_rx</name>
	<description>DCF timer for iffadc_ldo_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG6_BLE_REG</name>
	
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>vco_ldo_en_ble_dcf_tx</name>
	<description>DCF timer for vco_ldo_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>vco_ldo_en_ble_dcf_rx</name>
	<description>DCF timer for vco_ldo_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG6_FTDF_REG</name>
	
	<addressOffset>0x0000008c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>vco_ldo_en_ftdf_dcf_tx</name>
	<description>DCF timer for vco_ldo_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>vco_ldo_en_ftdf_dcf_rx</name>
	<description>DCF timer for vco_ldo_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG7_BLE_REG</name>
	
	<addressOffset>0x0000000e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>md_ldo_en_ble_dcf_tx</name>
	<description>DCF timer for md_ldo_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>md_ldo_en_ble_dcf_rx</name>
	<description>DCF timer for md_ldo_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG7_FTDF_REG</name>
	
	<addressOffset>0x0000008e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>md_ldo_en_ftdf_dcf_tx</name>
	<description>DCF timer for md_ldo_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>md_ldo_en_ftdf_dcf_rx</name>
	<description>DCF timer for md_ldo_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG8_BLE_REG</name>
	
	<addressOffset>0x00000010</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>pfd_ldo_en_ble_dcf_tx</name>
	<description>DCF timer for pfd_ldo_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>pfd_ldo_en_ble_dcf_rx</name>
	<description>DCF timer for pfd_ldo_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG8_FTDF_REG</name>
	
	<addressOffset>0x00000090</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>pfd_ldo_en_ftdf_dcf_tx</name>
	<description>DCF timer for pfd_ldo_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>pfd_ldo_en_ftdf_dcf_rx</name>
	<description>DCF timer for pfd_ldo_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG9_BLE_REG</name>
	
