SeanSouth/O1_demo/doc/DA14680AA.xml
When this bit is set to 1, the endpoint is isochronous. This implies that no NAK is sent if the endpoint is not ready but enabled; i.e. If an IN token is received and no data is available in the FIFO to transmit, or if an OUT token is received and the FIFO is full since there is no USB handshake for isochronous transfers. </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_EP_EN</name>
	<description>Endpoint Enable
When this bit is set to 1, the EP[3:0] field is used in address comparison, together with the AD[6:0] field in the FAR register. See Section
36.8
for a description. When cleared to 0, the endpoint does not respond to any token on the USB bus. </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_EP</name>
	<description>Endpoint Address
This 4-bit field holds the endpoint address. </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>USB_EPC5_REG</name>
	<description>Endpoint Control Register 5</description>
	<addressOffset>0x00000070</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>USB_STALL</name>
	<description>Stall
Setting this bit to 1 causes the chip to generate STALL handshakes under the following conditions:
The transmit FIFO is enabled and an IN token is received.
The receive FIFO is enabled and an OUT token is received.
Setting this bit to 1 does not generate a STALL handshake in response to a SETUP token </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_ISO</name>
	<description>Isochronous
When this bit is set to 1, the endpoint is isochronous. This implies that no NAK is sent if the endpoint is not ready but enabled; i.e. If an IN token is received and no data is available in the FIFO to transmit, or if an OUT token is received and the FIFO is full since there is no USB handshake for isochronous transfers. </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_EP_EN</name>
	<description>Endpoint Enable
When this bit is set to 1, the EP[3:0] field is used in address comparison, together with the AD[6:0] field in the FAR register. See Section
36.8
for a description. When cleared to 0, the endpoint does not respond to any token on the USB bus. </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_EP</name>
	<description>Endpoint Address
This 4-bit field holds the endpoint address. </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>USB_EPC6_REG</name>
	<description>Endpoint Control Register 6</description>
	<addressOffset>0x00000078</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>USB_STALL</name>
	<description>Stall
Setting this bit to 1 causes the chip to generate STALL handshakes under the following conditions:
The transmit FIFO is enabled and an IN token is received.
The receive FIFO is enabled and an OUT token is received.
Setting this bit to 1 does not generate a STALL handshake in response to a SETUP token </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_ISO</name>
	<description>Isochronous
When this bit is set to 1, the endpoint is isochronous. This implies that no NAK is sent if the endpoint is not ready but enabled; i.e. If an IN token is received and no data is available in the FIFO to transmit, or if an OUT token is received and the FIFO is full since there is no USB handshake for isochronous transfers. </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_EP_EN</name>
	<description>Endpoint Enable
When this bit is set to 1, the EP[3:0] field is used in address comparison, together with the AD[6:0] field in the FAR register. See Section
36.8
for a description. When cleared to 0, the endpoint does not respond to any token on the USB bus. </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_EP</name>
	<description>Endpoint Address
This 4-bit field holds the endpoint address. </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>USB_FAR_REG</name>
	<description>Function Address Register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>USB_AD_EN</name>
	<description>Address Enable
When set to 1, USB address field bits 6-0 are used in address comparison (see
&amp;quot;Address detection&amp;quot; on page 218
for a description). When cleared to 0, the device does not respond to any token on the USB bus.
Note: If the DEF bit in the Endpoint Control 0 register is set, Endpoint 0 responds to the default address. </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_AD</name>
	<description>Address
This field holds the 7-bit function address used to transmit and receive all tokens addressed to this device. </description>
	<access>read-write</access>
	<bitRange>[6:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>USB_FNH_REG</name>
	<description>Frame Number High Byte Register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000000c0</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>USB_MF</name>
	<description>Missed SOF Flag
This flag is set to 1, when the frame number in a valid received SOF does not match the expected next value, or when an SOF is not received within 12060 bit times. This bit is set by the hardware and is cleared by reading the FNH register. </description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_UL</name>
	<description>Unlock Flag
This bit indicates that at least two frames were received without an expected frame number, or that no valid SOF was received within 12060 bit times. If this bit is set, the frame number from the next valid SOF packet is loaded in FN. This bit is set by the hardware and is cleared by reading the FNH register. </description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_RFC</name>
	<description>Reset Frame Count
Writing a 1 to this bit resets the frame number to 00016, after which this bit clears itself to 0 again. This bit always reads 0. </description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_FN_10_8</name>
	<description>Frame Number
This 3-bit field contains the three most significant bits (MSB) of the current frame number, received in the last SOF packet. If a valid frame number is not received within 12060 bit times (Frame Length Maximum, FLMAX, with tolerance) of the previous change, the frame number is incremented artificially. If two successive frames are missed or are incorrect, the current FN is frozen and loaded with the next frame number from a valid SOF packet.
If the frame number low byte was read by firmware before reading the FNH register, the user actually reads the contents of a buffer register which holds the value of the three frame number bits of this register when the low byte was read. Therefore, the correct sequence to read the frame number is: FNL, FNH. Read operations to the FNH register, without first reading the Frame Number Low Byte (FNL) register directly, read the actual value of the three MSBs of the frame number. </description>
	<access>read-only</access>
	<bitRange>[2:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>USB_FNL_REG</name>
	<description>Frame Number Low Byte Register</description>
	<addressOffset>0x00000026</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>USB_FN</name>
	<description>The Frame Number Low Byte Register holds the low byte of the frame number. To ensure consistency, reading this low byte causes the three frame number bits in the FNH register to be locked until this register is read. The correct sequence to read the frame number is: FNL, FNH. </description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>USB_FWEV_REG</name>
	<description>FIFO Warning Event Register</description>
	<addressOffset>0x00000020</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>USB_RXWARN31</name>
	<description>Receive Warning n: 3:1
The bit n is set to 1 when the respective receive endpoint FIFO reaches the warning limit, as specified by the RFWL bits of the respective EPCx register. This bit is cleared when the warning condition is cleared by either reading data from the FIFO or when the FIFO is flushed. </description>
	<access>read-only</access>
	<bitRange>[6:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_TXWARN31</name>
	<description>Transmit Warning n: 3:1
The bit n is set to 1 when the respective transmit endpoint FIFO reaches the warning limit, as specified by the TFWL bits of the respective TXCn register, and transmission from the respective endpoint is enabled. This bit is cleared when the warning condition is cleared by either writing new data to the FIFO when the FIFO is flushed, or when transmission is done, as indicated by the TX_DONE bit in the TXSn register. </description>
	<access>read-only</access>
	<bitRange>[2:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>USB_FWMSK_REG</name>
	<description>FIFO Warning Mask Register</description>
	<addressOffset>0x00000022</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>USB_M_RXWARN31</name>
	<description>The FIFO Warning Mask Register selects, which FWEV bits are reported in the MAEV register. A bit set to 1 and the corresponding bit in the FWEV register is set 1, causes the WARN bit in the MAEV register to be set to 1. When cleared to 0, the corresponding bit in the FWEV register does not cause WARN to be set to 1. Same Bit Definition as FWEV Register </description>
	<access>read-write</access>
	<bitRange>[6:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_M_TXWARN31</name>
	<description>The FIFO Warning Mask Register selects, which FWEV bits are reported in the MAEV register. A bit set to 1 and the corresponding bit in the FWEV register is set 1, causes the WARN bit in the MAEV register to be set to 1. When cleared to 0, the corresponding bit in the FWEV register does not cause WARN to be set to 1. Same Bit Definition as FWEV Register </description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>USB_MAEV_REG</name>
	<description>Main Event Register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>USB_CH_EV</name>
	<description>USB Charger event
This bit is set if one of the bits in USB_CHARGER_STAT_REG[2-0] change. This bit is cleared to 0 when if USB_CHARGER_STAT_REG is read. </description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_EP0_NAK</name>
	<description>Endpoint 0 NAK Event
This bit is an OR of EP0_NAK_REG[EP0_OUTNAK] and EP0_NAK_REG[EP0_INNAK] bits. USB_EP0_NAK is cleared to 0 when EP0_NAK_REG is read. </description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_EP0_RX</name>
	<description>Endpoint 0 Receive Event
This bit is a copy of the RXS0[RX_LAST] and is cleared to 0 when this RXS0 register is read.
Note: Since Endpoint 0 implements a store and forward principle, an overrun condition for FIFO0 cannot occur </description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_EP0_TX</name>
	<description>Endpoint 0 Transmit Event
This bit is a copy of the TXS0[TX_DONE] bit and is cleared to 0 when the TXS0 register is read.
Note: Since Endpoint 0 implements a store and forward principle, an underrun condition for FIFO0 cannot occur. </description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_INTR</name>
	<description>Master Interrupt Enable
This bit is hardwired to 0 in the Main Event (MAEV) register; bit 7 in the Main Mask (MAMSK) register is the Master Interrupt Enable. </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_RX_EV</name>
	<description>Receive Event
This bit is set to 1 if any of the unmasked bits in the Receive Event (RXEV) register is set to 1. It indicates that a SETUP or OUT transaction has been completed. This bit is cleared to 0 when all of the RX_LAST bits in each Receive Status (RXSn) register and all RXOVRRN bits in the RXEV register are cleared to 0. </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_ULD</name>
	<description>Unlocked/Locked Detected
This bit is set to 1, when the frame timer has either entered unlocked condition from a locked condition, or has re-entered a locked condition from an unlocked condition as determined by the UL bit in the Frame Number (FNH or FNL) register. This bit is cleared to 0 when the register is read. </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_NAK</name>
	<description>Negative Acknowledge Event
This bit indicates that one of the unmasked NAK Event (NAKEV) register bits has been set to 1. This bit is cleared to 0 when the NAKEV register is read. </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_FRAME</name>
	<description>Frame Event
This bit is set to 1, if the frame counter is updated with a new value. This can be due to the receipt of a valid SOF packet on the USB or to an artificial update if the frame counter was unlocked or a frame was missed. This bit is cleared to 0 when the register is read. </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_TX_EV</name>
	<description>Transmit Event
This bit is set to 1, if any of the unmasked bits in the Transmit Event (TXEV) register (TXFIFOn or TXUNDRNn) is set to 1. Therefore, it indicates that an IN transaction has been completed. This bit is cleared to 0 when all the TX_DONE bits and the TXUNDRN bits in each Transmit Status (TXSn) register are cleared to 0. </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_ALT</name>
	<description>Alternate Event
This bit indicates that one of the unmasked ALTEV register bits has been set to 1. This bit is cleared to 0 by reading the ALTEV register. </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_WARN</name>
	<description>Warning Event
This bit indicates that one of the unmasked bits in the FIFO Warning Event (FWEV) register has been set to 1. This bit is cleared to 0 by reading the FWEV register. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>USB_MAMSK_REG</name>
	<description>Main Mask Register</description>
	<addressOffset>0x0000000e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>USB_M_CH_EV</name>
	<description>The Main Mask Register masks out events reported in the MAEV registers. A bit set to 1, enables the interrupts for the respective event in the MAEV register. If the corresponding bit is cleared to 0, interrupt generation for this event is disabled. Same Bit Definition as MAEV Register </description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_M_EP0_NAK</name>
	<description>Same Bit Definition as MAEV Register </description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_M_EP0_RX</name>
	<description>Same Bit Definition as MAEV Register</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_M_EP0_TX</name>
	<description>Same Bit Definition as MAEV Register</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_M_INTR</name>
	<description>Same Bit Definition as MAEV Register </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_M_RX_EV</name>
	<description>Same Bit Definition as MAEV Register </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_M_ULD</name>
	<description>Same Bit Definition as MAEV Register </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_M_NAK</name>
	<description>Same Bit Definition as MAEV Register </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_M_FRAME</name>
	<description>Same Bit Definition as MAEV Register </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_M_TX_EV</name>
	<description>Same Bit Definition as MAEV Register </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_M_ALT</name>
	<description>Same Bit Definition as MAEV Register </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_M_WARN</name>
	<description>Same Bit Definition as MAEV Register </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>USB_MCTRL_REG</name>
	<description>Main Control Register)</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>LSMODE</name>
	<description>Low Speed Mode
This bit enables USB 1.5 Mbit/s low speed and swaps D+ and D- pull-up resistors. Changing speed may only be done if USBEN is set to 0.
Also D+ and D- rise and fall times are adjusted according to the USB specification. </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_NAT</name>
	<description>Node Attached
This bit indicates that this node is ready to be detected as attached to USB. When cleared to 0 the transceiver forces SE0 on the USB port to prevent the hub (to which this node is connected to) from detecting an attach event. After reset or when the USB node is disabled, this bit is cleared to 0 to give the device time before it must respond to commands. After this bit has been set to 1, the device no longer drives the USB and should be ready to receive Reset signalling from the hub.
Note: This bit can only be set is USBEN is '1' </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USB_DBG</name>
	<description>Debug Mode.
When this bit is set, the following registers are writable: Main Event (MAEV), Alternate Event (ALTEV), NAK Event (NAKEV), Transmit Status and Receive Status. Setting the DBG bit forces the node into a locked state. The node states can be read out of the transceiver diagnostic register (XCVDIAG) at location 0xFF6802 by setting the DIAG bit in the Test Control register (UTR).
Note: The operation of CoR bits is not effected by entering Debug mode) Note: This bit can only be set is USBEN is '1' </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>USBEN</name>
	<description>USB EnableSetting this bit to 1 enables the Full/Low Speed USB node. If the USBEN bit is cleared to 0, the USB is disabled and the 48 MHz clock within the USB node is stopped. In addition, all USB registers are set to their reset state, except for the mentioned registers in Note
45
.
Note that the transceiver forces SE0 on the bus to prevent the hub to detected the USB node, when it is disabled (not attached).
The USBEN bit is cleared to 0 after reset </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>USB_NAKEV_REG</name>
	<description>NAK Event Register</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>USB_OUT31</name>
	<description>OUT n: 3:1
